Information: Loading SDC version 2.1 file '/slowfs/dcopt105/alvaro/DCG_congestion/test1/SRMui_spg_test/dcg30_czr/pv_export/dcg_lWoOAh_22524/data/des.sdc.tcl.SCENARIO' (FILE-007)
set_max_transition 1.5 [current_design]
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports clk]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports rst_n]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[31]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[30]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[29]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[28]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[27]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[26]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[25]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[24]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[23]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[22]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[21]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[20]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[19]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[18]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[17]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[16]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[15]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[14]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[13]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[12]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[11]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[10]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[9]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[8]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[7]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[6]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[5]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[4]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[3]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[2]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[1]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[0]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[32]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[31]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[30]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[29]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[28]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[27]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[26]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[25]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[24]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[23]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[22]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[21]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[20]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[19]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[18]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[17]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[16]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[15]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[14]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[13]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[12]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[11]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[10]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[9]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[8]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[7]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[6]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[5]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[4]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[3]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[2]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[1]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[0]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[32]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[31]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[30]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[29]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[28]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[27]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[26]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[25]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[24]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[23]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[22]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[21]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[20]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[19]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[18]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[17]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[16]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[15]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[14]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[13]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[12]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[11]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[10]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[9]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[8]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[7]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[6]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[5]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[4]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[3]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[2]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[1]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[0]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[32]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[31]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[30]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[29]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[28]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[27]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[26]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[25]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[24]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[23]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[22]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[21]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[20]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[19]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[18]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[17]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[16]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[15]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[14]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[13]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[12]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[11]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[10]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[9]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[8]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[7]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[6]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[5]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[4]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[3]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[2]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[1]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[0]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {mode1[2]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {mode1[1]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {mode1[0]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {mode2[2]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {mode2[1]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {mode2[0]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_load -pin_load 0.01 [get_ports {bb[46]}]
set_load -pin_load 0.01 [get_ports {bb[45]}]
set_load -pin_load 0.01 [get_ports {bb[44]}]
set_load -pin_load 0.01 [get_ports {bb[43]}]
set_load -pin_load 0.01 [get_ports {bb[42]}]
set_load -pin_load 0.01 [get_ports {bb[41]}]
set_load -pin_load 0.01 [get_ports {bb[40]}]
set_load -pin_load 0.01 [get_ports {bb[39]}]
set_load -pin_load 0.01 [get_ports {bb[38]}]
set_load -pin_load 0.01 [get_ports {bb[37]}]
set_load -pin_load 0.01 [get_ports {bb[36]}]
set_load -pin_load 0.01 [get_ports {bb[35]}]
set_load -pin_load 0.01 [get_ports {bb[34]}]
set_load -pin_load 0.01 [get_ports {bb[33]}]
set_load -pin_load 0.01 [get_ports {bb[32]}]
set_load -pin_load 0.01 [get_ports {bb[31]}]
set_load -pin_load 0.01 [get_ports {bb[30]}]
set_load -pin_load 0.01 [get_ports {bb[29]}]
set_load -pin_load 0.01 [get_ports {bb[28]}]
set_load -pin_load 0.01 [get_ports {bb[27]}]
set_load -pin_load 0.01 [get_ports {bb[26]}]
set_load -pin_load 0.01 [get_ports {bb[25]}]
set_load -pin_load 0.01 [get_ports {bb[24]}]
set_load -pin_load 0.01 [get_ports {bb[23]}]
set_load -pin_load 0.01 [get_ports {bb[22]}]
set_load -pin_load 0.01 [get_ports {bb[21]}]
set_load -pin_load 0.01 [get_ports {bb[20]}]
set_load -pin_load 0.01 [get_ports {bb[19]}]
set_load -pin_load 0.01 [get_ports {bb[18]}]
set_load -pin_load 0.01 [get_ports {bb[17]}]
set_load -pin_load 0.01 [get_ports {bb[16]}]
set_load -pin_load 0.01 [get_ports {bb[15]}]
set_load -pin_load 0.01 [get_ports {bb[14]}]
set_load -pin_load 0.01 [get_ports {bb[13]}]
set_load -pin_load 0.01 [get_ports {bb[12]}]
set_load -pin_load 0.01 [get_ports {bb[11]}]
set_load -pin_load 0.01 [get_ports {bb[10]}]
set_load -pin_load 0.01 [get_ports {bb[9]}]
set_load -pin_load 0.01 [get_ports {bb[8]}]
set_load -pin_load 0.01 [get_ports {bb[7]}]
set_load -pin_load 0.01 [get_ports {bb[6]}]
set_load -pin_load 0.01 [get_ports {bb[5]}]
set_load -pin_load 0.01 [get_ports {bb[4]}]
set_load -pin_load 0.01 [get_ports {bb[3]}]
set_load -pin_load 0.01 [get_ports {bb[2]}]
set_load -pin_load 0.01 [get_ports {bb[1]}]
set_load -pin_load 0.01 [get_ports {bb[0]}]
set_max_fanout 1 [get_ports clk]
Warning: The 'set_max_fanout' command is not supported in this program.  The command will be ignored. (CSTR-011)
set_max_fanout 1 [get_ports rst_n]
set_max_fanout 1 [get_ports {addr[31]}]
set_max_fanout 1 [get_ports {addr[30]}]
set_max_fanout 1 [get_ports {addr[29]}]
set_max_fanout 1 [get_ports {addr[28]}]
set_max_fanout 1 [get_ports {addr[27]}]
set_max_fanout 1 [get_ports {addr[26]}]
set_max_fanout 1 [get_ports {addr[25]}]
set_max_fanout 1 [get_ports {addr[24]}]
set_max_fanout 1 [get_ports {addr[23]}]
set_max_fanout 1 [get_ports {addr[22]}]
set_max_fanout 1 [get_ports {addr[21]}]
set_max_fanout 1 [get_ports {addr[20]}]
set_max_fanout 1 [get_ports {addr[19]}]
set_max_fanout 1 [get_ports {addr[18]}]
set_max_fanout 1 [get_ports {addr[17]}]
set_max_fanout 1 [get_ports {addr[16]}]
set_max_fanout 1 [get_ports {addr[15]}]
set_max_fanout 1 [get_ports {addr[14]}]
set_max_fanout 1 [get_ports {addr[13]}]
set_max_fanout 1 [get_ports {addr[12]}]
set_max_fanout 1 [get_ports {addr[11]}]
set_max_fanout 1 [get_ports {addr[10]}]
set_max_fanout 1 [get_ports {addr[9]}]
set_max_fanout 1 [get_ports {addr[8]}]
set_max_fanout 1 [get_ports {addr[7]}]
set_max_fanout 1 [get_ports {addr[6]}]
set_max_fanout 1 [get_ports {addr[5]}]
set_max_fanout 1 [get_ports {addr[4]}]
set_max_fanout 1 [get_ports {addr[3]}]
set_max_fanout 1 [get_ports {addr[2]}]
set_max_fanout 1 [get_ports {addr[1]}]
set_max_fanout 1 [get_ports {addr[0]}]
set_max_fanout 1 [get_ports {aa1[32]}]
set_max_fanout 1 [get_ports {aa1[31]}]
set_max_fanout 1 [get_ports {aa1[30]}]
set_max_fanout 1 [get_ports {aa1[29]}]
set_max_fanout 1 [get_ports {aa1[28]}]
set_max_fanout 1 [get_ports {aa1[27]}]
set_max_fanout 1 [get_ports {aa1[26]}]
set_max_fanout 1 [get_ports {aa1[25]}]
set_max_fanout 1 [get_ports {aa1[24]}]
set_max_fanout 1 [get_ports {aa1[23]}]
set_max_fanout 1 [get_ports {aa1[22]}]
set_max_fanout 1 [get_ports {aa1[21]}]
set_max_fanout 1 [get_ports {aa1[20]}]
set_max_fanout 1 [get_ports {aa1[19]}]
set_max_fanout 1 [get_ports {aa1[18]}]
set_max_fanout 1 [get_ports {aa1[17]}]
set_max_fanout 1 [get_ports {aa1[16]}]
set_max_fanout 1 [get_ports {aa1[15]}]
set_max_fanout 1 [get_ports {aa1[14]}]
set_max_fanout 1 [get_ports {aa1[13]}]
set_max_fanout 1 [get_ports {aa1[12]}]
set_max_fanout 1 [get_ports {aa1[11]}]
set_max_fanout 1 [get_ports {aa1[10]}]
set_max_fanout 1 [get_ports {aa1[9]}]
set_max_fanout 1 [get_ports {aa1[8]}]
set_max_fanout 1 [get_ports {aa1[7]}]
set_max_fanout 1 [get_ports {aa1[6]}]
set_max_fanout 1 [get_ports {aa1[5]}]
set_max_fanout 1 [get_ports {aa1[4]}]
set_max_fanout 1 [get_ports {aa1[3]}]
set_max_fanout 1 [get_ports {aa1[2]}]
set_max_fanout 1 [get_ports {aa1[1]}]
set_max_fanout 1 [get_ports {aa1[0]}]
set_max_fanout 1 [get_ports {aa2[32]}]
set_max_fanout 1 [get_ports {aa2[31]}]
set_max_fanout 1 [get_ports {aa2[30]}]
set_max_fanout 1 [get_ports {aa2[29]}]
set_max_fanout 1 [get_ports {aa2[28]}]
set_max_fanout 1 [get_ports {aa2[27]}]
set_max_fanout 1 [get_ports {aa2[26]}]
set_max_fanout 1 [get_ports {aa2[25]}]
set_max_fanout 1 [get_ports {aa2[24]}]
set_max_fanout 1 [get_ports {aa2[23]}]
set_max_fanout 1 [get_ports {aa2[22]}]
set_max_fanout 1 [get_ports {aa2[21]}]
set_max_fanout 1 [get_ports {aa2[20]}]
set_max_fanout 1 [get_ports {aa2[19]}]
set_max_fanout 1 [get_ports {aa2[18]}]
set_max_fanout 1 [get_ports {aa2[17]}]
set_max_fanout 1 [get_ports {aa2[16]}]
set_max_fanout 1 [get_ports {aa2[15]}]
set_max_fanout 1 [get_ports {aa2[14]}]
set_max_fanout 1 [get_ports {aa2[13]}]
set_max_fanout 1 [get_ports {aa2[12]}]
set_max_fanout 1 [get_ports {aa2[11]}]
set_max_fanout 1 [get_ports {aa2[10]}]
set_max_fanout 1 [get_ports {aa2[9]}]
set_max_fanout 1 [get_ports {aa2[8]}]
set_max_fanout 1 [get_ports {aa2[7]}]
set_max_fanout 1 [get_ports {aa2[6]}]
set_max_fanout 1 [get_ports {aa2[5]}]
set_max_fanout 1 [get_ports {aa2[4]}]
set_max_fanout 1 [get_ports {aa2[3]}]
set_max_fanout 1 [get_ports {aa2[2]}]
set_max_fanout 1 [get_ports {aa2[1]}]
set_max_fanout 1 [get_ports {aa2[0]}]
set_max_fanout 1 [get_ports {aa3[32]}]
set_max_fanout 1 [get_ports {aa3[31]}]
set_max_fanout 1 [get_ports {aa3[30]}]
set_max_fanout 1 [get_ports {aa3[29]}]
set_max_fanout 1 [get_ports {aa3[28]}]
set_max_fanout 1 [get_ports {aa3[27]}]
set_max_fanout 1 [get_ports {aa3[26]}]
set_max_fanout 1 [get_ports {aa3[25]}]
set_max_fanout 1 [get_ports {aa3[24]}]
set_max_fanout 1 [get_ports {aa3[23]}]
set_max_fanout 1 [get_ports {aa3[22]}]
set_max_fanout 1 [get_ports {aa3[21]}]
set_max_fanout 1 [get_ports {aa3[20]}]
set_max_fanout 1 [get_ports {aa3[19]}]
set_max_fanout 1 [get_ports {aa3[18]}]
set_max_fanout 1 [get_ports {aa3[17]}]
set_max_fanout 1 [get_ports {aa3[16]}]
set_max_fanout 1 [get_ports {aa3[15]}]
set_max_fanout 1 [get_ports {aa3[14]}]
set_max_fanout 1 [get_ports {aa3[13]}]
set_max_fanout 1 [get_ports {aa3[12]}]
set_max_fanout 1 [get_ports {aa3[11]}]
set_max_fanout 1 [get_ports {aa3[10]}]
set_max_fanout 1 [get_ports {aa3[9]}]
set_max_fanout 1 [get_ports {aa3[8]}]
set_max_fanout 1 [get_ports {aa3[7]}]
set_max_fanout 1 [get_ports {aa3[6]}]
set_max_fanout 1 [get_ports {aa3[5]}]
set_max_fanout 1 [get_ports {aa3[4]}]
set_max_fanout 1 [get_ports {aa3[3]}]
set_max_fanout 1 [get_ports {aa3[2]}]
set_max_fanout 1 [get_ports {aa3[1]}]
set_max_fanout 1 [get_ports {aa3[0]}]
set_max_fanout 1 [get_ports {mode1[2]}]
set_max_fanout 1 [get_ports {mode1[1]}]
set_max_fanout 1 [get_ports {mode1[0]}]
set_max_fanout 1 [get_ports {mode2[2]}]
set_max_fanout 1 [get_ports {mode2[1]}]
set_max_fanout 1 [get_ports {mode2[0]}]
set_clock_uncertainty -setup 0.35  [get_clocks clk]
set_clock_transition -max -rise 0.15 [get_clocks clk]
set_clock_transition -max -fall 0.15 [get_clocks clk]
set_clock_transition -min -rise 0 [get_clocks clk]
set_clock_transition -min -fall 0 [get_clocks clk]
set_input_delay -clock clk  0  [get_ports {addr[31]}]
************************************************************
Timer Settings:
Delay Calculation Style:                   auto
Signal Integrity Analysis:                 disabled
Timing Window Analysis:                    disabled
Advanced Waveform Propagation:             disabled
Variation Type:                            fixed_derate
Clock Reconvergence Pessimism Removal:     disabled
Advanced Receiver Model:                   disabled
************************************************************
set_input_delay -clock clk  0  [get_ports {addr[30]}]
set_input_delay -clock clk  0  [get_ports {addr[29]}]
set_input_delay -clock clk  0  [get_ports {addr[28]}]
set_input_delay -clock clk  0  [get_ports {addr[27]}]
set_input_delay -clock clk  0  [get_ports {addr[26]}]
set_input_delay -clock clk  0  [get_ports {addr[25]}]
set_input_delay -clock clk  0  [get_ports {addr[24]}]
set_input_delay -clock clk  0  [get_ports {addr[23]}]
set_input_delay -clock clk  0  [get_ports {addr[22]}]
set_input_delay -clock clk  0  [get_ports {addr[21]}]
set_input_delay -clock clk  0  [get_ports {addr[20]}]
set_input_delay -clock clk  0  [get_ports {addr[19]}]
set_input_delay -clock clk  0  [get_ports {addr[18]}]
set_input_delay -clock clk  0  [get_ports {addr[17]}]
set_input_delay -clock clk  0  [get_ports {addr[16]}]
set_input_delay -clock clk  0  [get_ports {addr[15]}]
set_input_delay -clock clk  0  [get_ports {addr[14]}]
set_input_delay -clock clk  0  [get_ports {addr[13]}]
set_input_delay -clock clk  0  [get_ports {addr[12]}]
set_input_delay -clock clk  0  [get_ports {addr[11]}]
set_input_delay -clock clk  0  [get_ports {addr[10]}]
set_input_delay -clock clk  0  [get_ports {addr[9]}]
set_input_delay -clock clk  0  [get_ports {addr[8]}]
set_input_delay -clock clk  0  [get_ports {addr[7]}]
set_input_delay -clock clk  0  [get_ports {addr[6]}]
set_input_delay -clock clk  0  [get_ports {addr[5]}]
set_input_delay -clock clk  0  [get_ports {addr[4]}]
set_input_delay -clock clk  0  [get_ports {addr[3]}]
set_input_delay -clock clk  0  [get_ports {addr[2]}]
set_input_delay -clock clk  0  [get_ports {addr[1]}]
set_input_delay -clock clk  0  [get_ports {addr[0]}]
set_input_delay -clock clk  0  [get_ports {aa1[32]}]
set_input_delay -clock clk  0  [get_ports {aa1[31]}]
set_input_delay -clock clk  0  [get_ports {aa1[30]}]
set_input_delay -clock clk  0  [get_ports {aa1[29]}]
set_input_delay -clock clk  0  [get_ports {aa1[28]}]
set_input_delay -clock clk  0  [get_ports {aa1[27]}]
set_input_delay -clock clk  0  [get_ports {aa1[26]}]
set_input_delay -clock clk  0  [get_ports {aa1[25]}]
set_input_delay -clock clk  0  [get_ports {aa1[24]}]
set_input_delay -clock clk  0  [get_ports {aa1[23]}]
set_input_delay -clock clk  0  [get_ports {aa1[22]}]
set_input_delay -clock clk  0  [get_ports {aa1[21]}]
set_input_delay -clock clk  0  [get_ports {aa1[20]}]
set_input_delay -clock clk  0  [get_ports {aa1[19]}]
set_input_delay -clock clk  0  [get_ports {aa1[18]}]
set_input_delay -clock clk  0  [get_ports {aa1[17]}]
set_input_delay -clock clk  0  [get_ports {aa1[16]}]
set_input_delay -clock clk  0  [get_ports {aa1[15]}]
set_input_delay -clock clk  0  [get_ports {aa1[14]}]
set_input_delay -clock clk  0  [get_ports {aa1[13]}]
set_input_delay -clock clk  0  [get_ports {aa1[12]}]
set_input_delay -clock clk  0  [get_ports {aa1[11]}]
set_input_delay -clock clk  0  [get_ports {aa1[10]}]
set_input_delay -clock clk  0  [get_ports {aa1[9]}]
set_input_delay -clock clk  0  [get_ports {aa1[8]}]
set_input_delay -clock clk  0  [get_ports {aa1[7]}]
set_input_delay -clock clk  0  [get_ports {aa1[6]}]
set_input_delay -clock clk  0  [get_ports {aa1[5]}]
set_input_delay -clock clk  0  [get_ports {aa1[4]}]
set_input_delay -clock clk  0  [get_ports {aa1[3]}]
set_input_delay -clock clk  0  [get_ports {aa1[2]}]
set_input_delay -clock clk  0  [get_ports {aa1[1]}]
set_input_delay -clock clk  0  [get_ports {aa1[0]}]
set_input_delay -clock clk  0  [get_ports {aa2[32]}]
set_input_delay -clock clk  0  [get_ports {aa2[31]}]
set_input_delay -clock clk  0  [get_ports {aa2[30]}]
set_input_delay -clock clk  0  [get_ports {aa2[29]}]
set_input_delay -clock clk  0  [get_ports {aa2[28]}]
set_input_delay -clock clk  0  [get_ports {aa2[27]}]
set_input_delay -clock clk  0  [get_ports {aa2[26]}]
set_input_delay -clock clk  0  [get_ports {aa2[25]}]
set_input_delay -clock clk  0  [get_ports {aa2[24]}]
set_input_delay -clock clk  0  [get_ports {aa2[23]}]
set_input_delay -clock clk  0  [get_ports {aa2[22]}]
set_input_delay -clock clk  0  [get_ports {aa2[21]}]
set_input_delay -clock clk  0  [get_ports {aa2[20]}]
set_input_delay -clock clk  0  [get_ports {aa2[19]}]
set_input_delay -clock clk  0  [get_ports {aa2[18]}]
set_input_delay -clock clk  0  [get_ports {aa2[17]}]
set_input_delay -clock clk  0  [get_ports {aa2[16]}]
set_input_delay -clock clk  0  [get_ports {aa2[15]}]
set_input_delay -clock clk  0  [get_ports {aa2[14]}]
set_input_delay -clock clk  0  [get_ports {aa2[13]}]
set_input_delay -clock clk  0  [get_ports {aa2[12]}]
set_input_delay -clock clk  0  [get_ports {aa2[11]}]
set_input_delay -clock clk  0  [get_ports {aa2[10]}]
set_input_delay -clock clk  0  [get_ports {aa2[9]}]
set_input_delay -clock clk  0  [get_ports {aa2[8]}]
set_input_delay -clock clk  0  [get_ports {aa2[7]}]
set_input_delay -clock clk  0  [get_ports {aa2[6]}]
set_input_delay -clock clk  0  [get_ports {aa2[5]}]
set_input_delay -clock clk  0  [get_ports {aa2[4]}]
set_input_delay -clock clk  0  [get_ports {aa2[3]}]
set_input_delay -clock clk  0  [get_ports {aa2[2]}]
set_input_delay -clock clk  0  [get_ports {aa2[1]}]
set_input_delay -clock clk  0  [get_ports {aa2[0]}]
set_input_delay -clock clk  0  [get_ports {aa3[32]}]
set_input_delay -clock clk  0  [get_ports {aa3[31]}]
set_input_delay -clock clk  0  [get_ports {aa3[30]}]
set_input_delay -clock clk  0  [get_ports {aa3[29]}]
set_input_delay -clock clk  0  [get_ports {aa3[28]}]
set_input_delay -clock clk  0  [get_ports {aa3[27]}]
set_input_delay -clock clk  0  [get_ports {aa3[26]}]
set_input_delay -clock clk  0  [get_ports {aa3[25]}]
set_input_delay -clock clk  0  [get_ports {aa3[24]}]
set_input_delay -clock clk  0  [get_ports {aa3[23]}]
set_input_delay -clock clk  0  [get_ports {aa3[22]}]
set_input_delay -clock clk  0  [get_ports {aa3[21]}]
set_input_delay -clock clk  0  [get_ports {aa3[20]}]
set_input_delay -clock clk  0  [get_ports {aa3[19]}]
set_input_delay -clock clk  0  [get_ports {aa3[18]}]
set_input_delay -clock clk  0  [get_ports {aa3[17]}]
set_input_delay -clock clk  0  [get_ports {aa3[16]}]
set_input_delay -clock clk  0  [get_ports {aa3[15]}]
set_input_delay -clock clk  0  [get_ports {aa3[14]}]
set_input_delay -clock clk  0  [get_ports {aa3[13]}]
set_input_delay -clock clk  0  [get_ports {aa3[12]}]
set_input_delay -clock clk  0  [get_ports {aa3[11]}]
set_input_delay -clock clk  0  [get_ports {aa3[10]}]
set_input_delay -clock clk  0  [get_ports {aa3[9]}]
set_input_delay -clock clk  0  [get_ports {aa3[8]}]
set_input_delay -clock clk  0  [get_ports {aa3[7]}]
set_input_delay -clock clk  0  [get_ports {aa3[6]}]
set_input_delay -clock clk  0  [get_ports {aa3[5]}]
set_input_delay -clock clk  0  [get_ports {aa3[4]}]
set_input_delay -clock clk  0  [get_ports {aa3[3]}]
set_input_delay -clock clk  0  [get_ports {aa3[2]}]
set_input_delay -clock clk  0  [get_ports {aa3[1]}]
set_input_delay -clock clk  0  [get_ports {aa3[0]}]
set_input_delay -clock clk  0  [get_ports {mode1[2]}]
set_input_delay -clock clk  0  [get_ports {mode1[1]}]
set_input_delay -clock clk  0  [get_ports {mode1[0]}]
set_input_delay -clock clk  0  [get_ports {mode2[2]}]
set_input_delay -clock clk  0  [get_ports {mode2[1]}]
set_input_delay -clock clk  0  [get_ports {mode2[0]}]
set_input_delay -clock clk  0  [get_ports rst_n]
set_output_delay -clock clk  0  [get_ports {bb[46]}]
set_output_delay -clock clk  0  [get_ports {bb[45]}]
set_output_delay -clock clk  0  [get_ports {bb[44]}]
set_output_delay -clock clk  0  [get_ports {bb[43]}]
set_output_delay -clock clk  0  [get_ports {bb[42]}]
set_output_delay -clock clk  0  [get_ports {bb[41]}]
set_output_delay -clock clk  0  [get_ports {bb[40]}]
set_output_delay -clock clk  0  [get_ports {bb[39]}]
set_output_delay -clock clk  0  [get_ports {bb[38]}]
set_output_delay -clock clk  0  [get_ports {bb[37]}]
set_output_delay -clock clk  0  [get_ports {bb[36]}]
set_output_delay -clock clk  0  [get_ports {bb[35]}]
set_output_delay -clock clk  0  [get_ports {bb[34]}]
set_output_delay -clock clk  0  [get_ports {bb[33]}]
set_output_delay -clock clk  0  [get_ports {bb[32]}]
set_output_delay -clock clk  0  [get_ports {bb[31]}]
set_output_delay -clock clk  0  [get_ports {bb[30]}]
set_output_delay -clock clk  0  [get_ports {bb[29]}]
set_output_delay -clock clk  0  [get_ports {bb[28]}]
set_output_delay -clock clk  0  [get_ports {bb[27]}]
set_output_delay -clock clk  0  [get_ports {bb[26]}]
set_output_delay -clock clk  0  [get_ports {bb[25]}]
set_output_delay -clock clk  0  [get_ports {bb[24]}]
set_output_delay -clock clk  0  [get_ports {bb[23]}]
set_output_delay -clock clk  0  [get_ports {bb[22]}]
set_output_delay -clock clk  0  [get_ports {bb[21]}]
set_output_delay -clock clk  0  [get_ports {bb[20]}]
set_output_delay -clock clk  0  [get_ports {bb[19]}]
set_output_delay -clock clk  0  [get_ports {bb[18]}]
set_output_delay -clock clk  0  [get_ports {bb[17]}]
set_output_delay -clock clk  0  [get_ports {bb[16]}]
set_output_delay -clock clk  0  [get_ports {bb[15]}]
set_output_delay -clock clk  0  [get_ports {bb[14]}]
set_output_delay -clock clk  0  [get_ports {bb[13]}]
set_output_delay -clock clk  0  [get_ports {bb[12]}]
set_output_delay -clock clk  0  [get_ports {bb[11]}]
set_output_delay -clock clk  0  [get_ports {bb[10]}]
set_output_delay -clock clk  0  [get_ports {bb[9]}]
set_output_delay -clock clk  0  [get_ports {bb[8]}]
set_output_delay -clock clk  0  [get_ports {bb[7]}]
set_output_delay -clock clk  0  [get_ports {bb[6]}]
set_output_delay -clock clk  0  [get_ports {bb[5]}]
set_output_delay -clock clk  0  [get_ports {bb[4]}]
set_output_delay -clock clk  0  [get_ports {bb[3]}]
set_output_delay -clock clk  0  [get_ports {bb[2]}]
set_output_delay -clock clk  0  [get_ports {bb[1]}]
set_output_delay -clock clk  0  [get_ports {bb[0]}]
1
Information: Loading SDC version 2.1 file '/slowfs/dcopt105/alvaro/DCG_congestion/test1/SRMui_spg_test/dcg30_czr/pv_export/dcg_lWoOAh_22524/data/des.sdc.tcl.SCENARIO' (FILE-007)
set_max_transition 1.5 [current_design]
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports clk]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports rst_n]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[31]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[30]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[29]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[28]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[27]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[26]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[25]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[24]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[23]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[22]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[21]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[20]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[19]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[18]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[17]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[16]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[15]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[14]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[13]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[12]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[11]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[10]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[9]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[8]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[7]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[6]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[5]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[4]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[3]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[2]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[1]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {addr[0]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[32]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[31]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[30]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[29]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[28]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[27]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[26]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[25]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[24]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[23]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[22]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[21]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[20]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[19]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[18]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[17]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[16]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[15]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[14]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[13]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[12]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[11]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[10]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[9]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[8]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[7]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[6]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[5]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[4]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[3]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[2]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[1]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa1[0]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[32]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[31]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[30]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[29]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[28]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[27]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[26]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[25]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[24]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[23]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[22]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[21]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[20]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[19]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[18]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[17]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[16]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[15]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[14]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[13]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[12]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[11]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[10]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[9]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[8]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[7]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[6]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[5]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[4]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[3]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[2]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[1]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa2[0]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[32]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[31]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[30]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[29]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[28]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[27]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[26]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[25]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[24]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[23]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[22]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[21]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[20]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[19]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[18]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[17]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[16]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[15]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[14]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[13]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[12]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[11]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[10]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[9]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[8]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[7]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[6]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[5]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[4]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[3]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[2]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[1]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {aa3[0]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {mode1[2]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {mode1[1]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {mode1[0]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {mode2[2]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {mode2[1]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_driving_cell -lib_cell SBC2LBUFV1D4 -library ngk_im1_stdlvt7g_C1V12S4_MAX  -no_design_rule [get_ports {mode2[0]}]
Warning: The -library option of set_driving_cell is not supported. (CSTR-022)
set_load -pin_load 0.01 [get_ports {bb[46]}]
set_load -pin_load 0.01 [get_ports {bb[45]}]
set_load -pin_load 0.01 [get_ports {bb[44]}]
set_load -pin_load 0.01 [get_ports {bb[43]}]
set_load -pin_load 0.01 [get_ports {bb[42]}]
set_load -pin_load 0.01 [get_ports {bb[41]}]
set_load -pin_load 0.01 [get_ports {bb[40]}]
set_load -pin_load 0.01 [get_ports {bb[39]}]
set_load -pin_load 0.01 [get_ports {bb[38]}]
set_load -pin_load 0.01 [get_ports {bb[37]}]
set_load -pin_load 0.01 [get_ports {bb[36]}]
set_load -pin_load 0.01 [get_ports {bb[35]}]
set_load -pin_load 0.01 [get_ports {bb[34]}]
set_load -pin_load 0.01 [get_ports {bb[33]}]
set_load -pin_load 0.01 [get_ports {bb[32]}]
set_load -pin_load 0.01 [get_ports {bb[31]}]
set_load -pin_load 0.01 [get_ports {bb[30]}]
set_load -pin_load 0.01 [get_ports {bb[29]}]
set_load -pin_load 0.01 [get_ports {bb[28]}]
set_load -pin_load 0.01 [get_ports {bb[27]}]
set_load -pin_load 0.01 [get_ports {bb[26]}]
set_load -pin_load 0.01 [get_ports {bb[25]}]
set_load -pin_load 0.01 [get_ports {bb[24]}]
set_load -pin_load 0.01 [get_ports {bb[23]}]
set_load -pin_load 0.01 [get_ports {bb[22]}]
set_load -pin_load 0.01 [get_ports {bb[21]}]
set_load -pin_load 0.01 [get_ports {bb[20]}]
set_load -pin_load 0.01 [get_ports {bb[19]}]
set_load -pin_load 0.01 [get_ports {bb[18]}]
set_load -pin_load 0.01 [get_ports {bb[17]}]
set_load -pin_load 0.01 [get_ports {bb[16]}]
set_load -pin_load 0.01 [get_ports {bb[15]}]
set_load -pin_load 0.01 [get_ports {bb[14]}]
set_load -pin_load 0.01 [get_ports {bb[13]}]
set_load -pin_load 0.01 [get_ports {bb[12]}]
set_load -pin_load 0.01 [get_ports {bb[11]}]
set_load -pin_load 0.01 [get_ports {bb[10]}]
set_load -pin_load 0.01 [get_ports {bb[9]}]
set_load -pin_load 0.01 [get_ports {bb[8]}]
set_load -pin_load 0.01 [get_ports {bb[7]}]
set_load -pin_load 0.01 [get_ports {bb[6]}]
set_load -pin_load 0.01 [get_ports {bb[5]}]
set_load -pin_load 0.01 [get_ports {bb[4]}]
set_load -pin_load 0.01 [get_ports {bb[3]}]
set_load -pin_load 0.01 [get_ports {bb[2]}]
set_load -pin_load 0.01 [get_ports {bb[1]}]
set_load -pin_load 0.01 [get_ports {bb[0]}]
set_max_fanout 1 [get_ports clk]
set_max_fanout 1 [get_ports rst_n]
set_max_fanout 1 [get_ports {addr[31]}]
set_max_fanout 1 [get_ports {addr[30]}]
set_max_fanout 1 [get_ports {addr[29]}]
set_max_fanout 1 [get_ports {addr[28]}]
set_max_fanout 1 [get_ports {addr[27]}]
set_max_fanout 1 [get_ports {addr[26]}]
set_max_fanout 1 [get_ports {addr[25]}]
set_max_fanout 1 [get_ports {addr[24]}]
set_max_fanout 1 [get_ports {addr[23]}]
set_max_fanout 1 [get_ports {addr[22]}]
set_max_fanout 1 [get_ports {addr[21]}]
set_max_fanout 1 [get_ports {addr[20]}]
set_max_fanout 1 [get_ports {addr[19]}]
set_max_fanout 1 [get_ports {addr[18]}]
set_max_fanout 1 [get_ports {addr[17]}]
set_max_fanout 1 [get_ports {addr[16]}]
set_max_fanout 1 [get_ports {addr[15]}]
set_max_fanout 1 [get_ports {addr[14]}]
set_max_fanout 1 [get_ports {addr[13]}]
set_max_fanout 1 [get_ports {addr[12]}]
set_max_fanout 1 [get_ports {addr[11]}]
set_max_fanout 1 [get_ports {addr[10]}]
set_max_fanout 1 [get_ports {addr[9]}]
set_max_fanout 1 [get_ports {addr[8]}]
set_max_fanout 1 [get_ports {addr[7]}]
set_max_fanout 1 [get_ports {addr[6]}]
set_max_fanout 1 [get_ports {addr[5]}]
set_max_fanout 1 [get_ports {addr[4]}]
set_max_fanout 1 [get_ports {addr[3]}]
set_max_fanout 1 [get_ports {addr[2]}]
set_max_fanout 1 [get_ports {addr[1]}]
set_max_fanout 1 [get_ports {addr[0]}]
set_max_fanout 1 [get_ports {aa1[32]}]
set_max_fanout 1 [get_ports {aa1[31]}]
set_max_fanout 1 [get_ports {aa1[30]}]
set_max_fanout 1 [get_ports {aa1[29]}]
set_max_fanout 1 [get_ports {aa1[28]}]
set_max_fanout 1 [get_ports {aa1[27]}]
set_max_fanout 1 [get_ports {aa1[26]}]
set_max_fanout 1 [get_ports {aa1[25]}]
set_max_fanout 1 [get_ports {aa1[24]}]
set_max_fanout 1 [get_ports {aa1[23]}]
set_max_fanout 1 [get_ports {aa1[22]}]
set_max_fanout 1 [get_ports {aa1[21]}]
set_max_fanout 1 [get_ports {aa1[20]}]
set_max_fanout 1 [get_ports {aa1[19]}]
set_max_fanout 1 [get_ports {aa1[18]}]
set_max_fanout 1 [get_ports {aa1[17]}]
set_max_fanout 1 [get_ports {aa1[16]}]
set_max_fanout 1 [get_ports {aa1[15]}]
set_max_fanout 1 [get_ports {aa1[14]}]
set_max_fanout 1 [get_ports {aa1[13]}]
set_max_fanout 1 [get_ports {aa1[12]}]
set_max_fanout 1 [get_ports {aa1[11]}]
set_max_fanout 1 [get_ports {aa1[10]}]
set_max_fanout 1 [get_ports {aa1[9]}]
set_max_fanout 1 [get_ports {aa1[8]}]
set_max_fanout 1 [get_ports {aa1[7]}]
set_max_fanout 1 [get_ports {aa1[6]}]
set_max_fanout 1 [get_ports {aa1[5]}]
set_max_fanout 1 [get_ports {aa1[4]}]
set_max_fanout 1 [get_ports {aa1[3]}]
set_max_fanout 1 [get_ports {aa1[2]}]
set_max_fanout 1 [get_ports {aa1[1]}]
set_max_fanout 1 [get_ports {aa1[0]}]
set_max_fanout 1 [get_ports {aa2[32]}]
set_max_fanout 1 [get_ports {aa2[31]}]
set_max_fanout 1 [get_ports {aa2[30]}]
set_max_fanout 1 [get_ports {aa2[29]}]
set_max_fanout 1 [get_ports {aa2[28]}]
set_max_fanout 1 [get_ports {aa2[27]}]
set_max_fanout 1 [get_ports {aa2[26]}]
set_max_fanout 1 [get_ports {aa2[25]}]
set_max_fanout 1 [get_ports {aa2[24]}]
set_max_fanout 1 [get_ports {aa2[23]}]
set_max_fanout 1 [get_ports {aa2[22]}]
set_max_fanout 1 [get_ports {aa2[21]}]
set_max_fanout 1 [get_ports {aa2[20]}]
set_max_fanout 1 [get_ports {aa2[19]}]
set_max_fanout 1 [get_ports {aa2[18]}]
set_max_fanout 1 [get_ports {aa2[17]}]
set_max_fanout 1 [get_ports {aa2[16]}]
set_max_fanout 1 [get_ports {aa2[15]}]
set_max_fanout 1 [get_ports {aa2[14]}]
set_max_fanout 1 [get_ports {aa2[13]}]
set_max_fanout 1 [get_ports {aa2[12]}]
set_max_fanout 1 [get_ports {aa2[11]}]
set_max_fanout 1 [get_ports {aa2[10]}]
set_max_fanout 1 [get_ports {aa2[9]}]
set_max_fanout 1 [get_ports {aa2[8]}]
set_max_fanout 1 [get_ports {aa2[7]}]
set_max_fanout 1 [get_ports {aa2[6]}]
set_max_fanout 1 [get_ports {aa2[5]}]
set_max_fanout 1 [get_ports {aa2[4]}]
set_max_fanout 1 [get_ports {aa2[3]}]
set_max_fanout 1 [get_ports {aa2[2]}]
set_max_fanout 1 [get_ports {aa2[1]}]
set_max_fanout 1 [get_ports {aa2[0]}]
set_max_fanout 1 [get_ports {aa3[32]}]
set_max_fanout 1 [get_ports {aa3[31]}]
set_max_fanout 1 [get_ports {aa3[30]}]
set_max_fanout 1 [get_ports {aa3[29]}]
set_max_fanout 1 [get_ports {aa3[28]}]
set_max_fanout 1 [get_ports {aa3[27]}]
set_max_fanout 1 [get_ports {aa3[26]}]
set_max_fanout 1 [get_ports {aa3[25]}]
set_max_fanout 1 [get_ports {aa3[24]}]
set_max_fanout 1 [get_ports {aa3[23]}]
set_max_fanout 1 [get_ports {aa3[22]}]
set_max_fanout 1 [get_ports {aa3[21]}]
set_max_fanout 1 [get_ports {aa3[20]}]
set_max_fanout 1 [get_ports {aa3[19]}]
set_max_fanout 1 [get_ports {aa3[18]}]
set_max_fanout 1 [get_ports {aa3[17]}]
set_max_fanout 1 [get_ports {aa3[16]}]
set_max_fanout 1 [get_ports {aa3[15]}]
set_max_fanout 1 [get_ports {aa3[14]}]
set_max_fanout 1 [get_ports {aa3[13]}]
set_max_fanout 1 [get_ports {aa3[12]}]
set_max_fanout 1 [get_ports {aa3[11]}]
set_max_fanout 1 [get_ports {aa3[10]}]
set_max_fanout 1 [get_ports {aa3[9]}]
set_max_fanout 1 [get_ports {aa3[8]}]
set_max_fanout 1 [get_ports {aa3[7]}]
set_max_fanout 1 [get_ports {aa3[6]}]
set_max_fanout 1 [get_ports {aa3[5]}]
set_max_fanout 1 [get_ports {aa3[4]}]
set_max_fanout 1 [get_ports {aa3[3]}]
set_max_fanout 1 [get_ports {aa3[2]}]
set_max_fanout 1 [get_ports {aa3[1]}]
set_max_fanout 1 [get_ports {aa3[0]}]
set_max_fanout 1 [get_ports {mode1[2]}]
set_max_fanout 1 [get_ports {mode1[1]}]
set_max_fanout 1 [get_ports {mode1[0]}]
set_max_fanout 1 [get_ports {mode2[2]}]
set_max_fanout 1 [get_ports {mode2[1]}]
set_max_fanout 1 [get_ports {mode2[0]}]
set_clock_uncertainty -setup 0.35  [get_clocks clk]
set_clock_transition -max -rise 0.15 [get_clocks clk]
set_clock_transition -max -fall 0.15 [get_clocks clk]
set_clock_transition -min -rise 0 [get_clocks clk]
set_clock_transition -min -fall 0 [get_clocks clk]
set_input_delay -clock clk  0  [get_ports {addr[31]}]
set_input_delay -clock clk  0  [get_ports {addr[30]}]
set_input_delay -clock clk  0  [get_ports {addr[29]}]
set_input_delay -clock clk  0  [get_ports {addr[28]}]
set_input_delay -clock clk  0  [get_ports {addr[27]}]
set_input_delay -clock clk  0  [get_ports {addr[26]}]
set_input_delay -clock clk  0  [get_ports {addr[25]}]
set_input_delay -clock clk  0  [get_ports {addr[24]}]
set_input_delay -clock clk  0  [get_ports {addr[23]}]
set_input_delay -clock clk  0  [get_ports {addr[22]}]
set_input_delay -clock clk  0  [get_ports {addr[21]}]
set_input_delay -clock clk  0  [get_ports {addr[20]}]
set_input_delay -clock clk  0  [get_ports {addr[19]}]
set_input_delay -clock clk  0  [get_ports {addr[18]}]
set_input_delay -clock clk  0  [get_ports {addr[17]}]
set_input_delay -clock clk  0  [get_ports {addr[16]}]
set_input_delay -clock clk  0  [get_ports {addr[15]}]
set_input_delay -clock clk  0  [get_ports {addr[14]}]
set_input_delay -clock clk  0  [get_ports {addr[13]}]
set_input_delay -clock clk  0  [get_ports {addr[12]}]
set_input_delay -clock clk  0  [get_ports {addr[11]}]
set_input_delay -clock clk  0  [get_ports {addr[10]}]
set_input_delay -clock clk  0  [get_ports {addr[9]}]
set_input_delay -clock clk  0  [get_ports {addr[8]}]
set_input_delay -clock clk  0  [get_ports {addr[7]}]
set_input_delay -clock clk  0  [get_ports {addr[6]}]
set_input_delay -clock clk  0  [get_ports {addr[5]}]
set_input_delay -clock clk  0  [get_ports {addr[4]}]
set_input_delay -clock clk  0  [get_ports {addr[3]}]
set_input_delay -clock clk  0  [get_ports {addr[2]}]
set_input_delay -clock clk  0  [get_ports {addr[1]}]
set_input_delay -clock clk  0  [get_ports {addr[0]}]
set_input_delay -clock clk  0  [get_ports {aa1[32]}]
set_input_delay -clock clk  0  [get_ports {aa1[31]}]
set_input_delay -clock clk  0  [get_ports {aa1[30]}]
set_input_delay -clock clk  0  [get_ports {aa1[29]}]
set_input_delay -clock clk  0  [get_ports {aa1[28]}]
set_input_delay -clock clk  0  [get_ports {aa1[27]}]
set_input_delay -clock clk  0  [get_ports {aa1[26]}]
set_input_delay -clock clk  0  [get_ports {aa1[25]}]
set_input_delay -clock clk  0  [get_ports {aa1[24]}]
set_input_delay -clock clk  0  [get_ports {aa1[23]}]
set_input_delay -clock clk  0  [get_ports {aa1[22]}]
set_input_delay -clock clk  0  [get_ports {aa1[21]}]
set_input_delay -clock clk  0  [get_ports {aa1[20]}]
set_input_delay -clock clk  0  [get_ports {aa1[19]}]
set_input_delay -clock clk  0  [get_ports {aa1[18]}]
set_input_delay -clock clk  0  [get_ports {aa1[17]}]
set_input_delay -clock clk  0  [get_ports {aa1[16]}]
set_input_delay -clock clk  0  [get_ports {aa1[15]}]
set_input_delay -clock clk  0  [get_ports {aa1[14]}]
set_input_delay -clock clk  0  [get_ports {aa1[13]}]
set_input_delay -clock clk  0  [get_ports {aa1[12]}]
set_input_delay -clock clk  0  [get_ports {aa1[11]}]
set_input_delay -clock clk  0  [get_ports {aa1[10]}]
set_input_delay -clock clk  0  [get_ports {aa1[9]}]
set_input_delay -clock clk  0  [get_ports {aa1[8]}]
set_input_delay -clock clk  0  [get_ports {aa1[7]}]
set_input_delay -clock clk  0  [get_ports {aa1[6]}]
set_input_delay -clock clk  0  [get_ports {aa1[5]}]
set_input_delay -clock clk  0  [get_ports {aa1[4]}]
set_input_delay -clock clk  0  [get_ports {aa1[3]}]
set_input_delay -clock clk  0  [get_ports {aa1[2]}]
set_input_delay -clock clk  0  [get_ports {aa1[1]}]
set_input_delay -clock clk  0  [get_ports {aa1[0]}]
set_input_delay -clock clk  0  [get_ports {aa2[32]}]
set_input_delay -clock clk  0  [get_ports {aa2[31]}]
set_input_delay -clock clk  0  [get_ports {aa2[30]}]
set_input_delay -clock clk  0  [get_ports {aa2[29]}]
set_input_delay -clock clk  0  [get_ports {aa2[28]}]
set_input_delay -clock clk  0  [get_ports {aa2[27]}]
set_input_delay -clock clk  0  [get_ports {aa2[26]}]
set_input_delay -clock clk  0  [get_ports {aa2[25]}]
set_input_delay -clock clk  0  [get_ports {aa2[24]}]
set_input_delay -clock clk  0  [get_ports {aa2[23]}]
set_input_delay -clock clk  0  [get_ports {aa2[22]}]
set_input_delay -clock clk  0  [get_ports {aa2[21]}]
set_input_delay -clock clk  0  [get_ports {aa2[20]}]
set_input_delay -clock clk  0  [get_ports {aa2[19]}]
set_input_delay -clock clk  0  [get_ports {aa2[18]}]
set_input_delay -clock clk  0  [get_ports {aa2[17]}]
set_input_delay -clock clk  0  [get_ports {aa2[16]}]
set_input_delay -clock clk  0  [get_ports {aa2[15]}]
set_input_delay -clock clk  0  [get_ports {aa2[14]}]
set_input_delay -clock clk  0  [get_ports {aa2[13]}]
set_input_delay -clock clk  0  [get_ports {aa2[12]}]
set_input_delay -clock clk  0  [get_ports {aa2[11]}]
set_input_delay -clock clk  0  [get_ports {aa2[10]}]
set_input_delay -clock clk  0  [get_ports {aa2[9]}]
set_input_delay -clock clk  0  [get_ports {aa2[8]}]
set_input_delay -clock clk  0  [get_ports {aa2[7]}]
set_input_delay -clock clk  0  [get_ports {aa2[6]}]
set_input_delay -clock clk  0  [get_ports {aa2[5]}]
set_input_delay -clock clk  0  [get_ports {aa2[4]}]
set_input_delay -clock clk  0  [get_ports {aa2[3]}]
set_input_delay -clock clk  0  [get_ports {aa2[2]}]
set_input_delay -clock clk  0  [get_ports {aa2[1]}]
set_input_delay -clock clk  0  [get_ports {aa2[0]}]
set_input_delay -clock clk  0  [get_ports {aa3[32]}]
set_input_delay -clock clk  0  [get_ports {aa3[31]}]
set_input_delay -clock clk  0  [get_ports {aa3[30]}]
set_input_delay -clock clk  0  [get_ports {aa3[29]}]
set_input_delay -clock clk  0  [get_ports {aa3[28]}]
set_input_delay -clock clk  0  [get_ports {aa3[27]}]
set_input_delay -clock clk  0  [get_ports {aa3[26]}]
set_input_delay -clock clk  0  [get_ports {aa3[25]}]
set_input_delay -clock clk  0  [get_ports {aa3[24]}]
set_input_delay -clock clk  0  [get_ports {aa3[23]}]
set_input_delay -clock clk  0  [get_ports {aa3[22]}]
set_input_delay -clock clk  0  [get_ports {aa3[21]}]
set_input_delay -clock clk  0  [get_ports {aa3[20]}]
set_input_delay -clock clk  0  [get_ports {aa3[19]}]
set_input_delay -clock clk  0  [get_ports {aa3[18]}]
set_input_delay -clock clk  0  [get_ports {aa3[17]}]
set_input_delay -clock clk  0  [get_ports {aa3[16]}]
set_input_delay -clock clk  0  [get_ports {aa3[15]}]
set_input_delay -clock clk  0  [get_ports {aa3[14]}]
set_input_delay -clock clk  0  [get_ports {aa3[13]}]
set_input_delay -clock clk  0  [get_ports {aa3[12]}]
set_input_delay -clock clk  0  [get_ports {aa3[11]}]
set_input_delay -clock clk  0  [get_ports {aa3[10]}]
set_input_delay -clock clk  0  [get_ports {aa3[9]}]
set_input_delay -clock clk  0  [get_ports {aa3[8]}]
set_input_delay -clock clk  0  [get_ports {aa3[7]}]
set_input_delay -clock clk  0  [get_ports {aa3[6]}]
set_input_delay -clock clk  0  [get_ports {aa3[5]}]
set_input_delay -clock clk  0  [get_ports {aa3[4]}]
set_input_delay -clock clk  0  [get_ports {aa3[3]}]
set_input_delay -clock clk  0  [get_ports {aa3[2]}]
set_input_delay -clock clk  0  [get_ports {aa3[1]}]
set_input_delay -clock clk  0  [get_ports {aa3[0]}]
set_input_delay -clock clk  0  [get_ports {mode1[2]}]
set_input_delay -clock clk  0  [get_ports {mode1[1]}]
set_input_delay -clock clk  0  [get_ports {mode1[0]}]
set_input_delay -clock clk  0  [get_ports {mode2[2]}]
set_input_delay -clock clk  0  [get_ports {mode2[1]}]
set_input_delay -clock clk  0  [get_ports {mode2[0]}]
set_input_delay -clock clk  0  [get_ports rst_n]
set_output_delay -clock clk  0  [get_ports {bb[46]}]
set_output_delay -clock clk  0  [get_ports {bb[45]}]
set_output_delay -clock clk  0  [get_ports {bb[44]}]
set_output_delay -clock clk  0  [get_ports {bb[43]}]
set_output_delay -clock clk  0  [get_ports {bb[42]}]
set_output_delay -clock clk  0  [get_ports {bb[41]}]
set_output_delay -clock clk  0  [get_ports {bb[40]}]
set_output_delay -clock clk  0  [get_ports {bb[39]}]
set_output_delay -clock clk  0  [get_ports {bb[38]}]
set_output_delay -clock clk  0  [get_ports {bb[37]}]
set_output_delay -clock clk  0  [get_ports {bb[36]}]
set_output_delay -clock clk  0  [get_ports {bb[35]}]
set_output_delay -clock clk  0  [get_ports {bb[34]}]
set_output_delay -clock clk  0  [get_ports {bb[33]}]
set_output_delay -clock clk  0  [get_ports {bb[32]}]
set_output_delay -clock clk  0  [get_ports {bb[31]}]
set_output_delay -clock clk  0  [get_ports {bb[30]}]
set_output_delay -clock clk  0  [get_ports {bb[29]}]
set_output_delay -clock clk  0  [get_ports {bb[28]}]
set_output_delay -clock clk  0  [get_ports {bb[27]}]
set_output_delay -clock clk  0  [get_ports {bb[26]}]
set_output_delay -clock clk  0  [get_ports {bb[25]}]
set_output_delay -clock clk  0  [get_ports {bb[24]}]
set_output_delay -clock clk  0  [get_ports {bb[23]}]
set_output_delay -clock clk  0  [get_ports {bb[22]}]
set_output_delay -clock clk  0  [get_ports {bb[21]}]
set_output_delay -clock clk  0  [get_ports {bb[20]}]
set_output_delay -clock clk  0  [get_ports {bb[19]}]
set_output_delay -clock clk  0  [get_ports {bb[18]}]
set_output_delay -clock clk  0  [get_ports {bb[17]}]
set_output_delay -clock clk  0  [get_ports {bb[16]}]
set_output_delay -clock clk  0  [get_ports {bb[15]}]
set_output_delay -clock clk  0  [get_ports {bb[14]}]
set_output_delay -clock clk  0  [get_ports {bb[13]}]
set_output_delay -clock clk  0  [get_ports {bb[12]}]
set_output_delay -clock clk  0  [get_ports {bb[11]}]
set_output_delay -clock clk  0  [get_ports {bb[10]}]
set_output_delay -clock clk  0  [get_ports {bb[9]}]
set_output_delay -clock clk  0  [get_ports {bb[8]}]
set_output_delay -clock clk  0  [get_ports {bb[7]}]
set_output_delay -clock clk  0  [get_ports {bb[6]}]
set_output_delay -clock clk  0  [get_ports {bb[5]}]
set_output_delay -clock clk  0  [get_ports {bb[4]}]
set_output_delay -clock clk  0  [get_ports {bb[3]}]
set_output_delay -clock clk  0  [get_ports {bb[2]}]
set_output_delay -clock clk  0  [get_ports {bb[1]}]
set_output_delay -clock clk  0  [get_ports {bb[0]}]
1
